
// JS 200제 문자열을 숫자형 정수로 변환하기(parseint) (중급 65)

// parseInt() 는 어떤 내장함수 객체에도 속하지 않은, 전역에서 사용할 수 있는 내장 함수입니다.
// parseInt()를 활용하여 문자열 자료형을 숫자로 변환할 수 있습니다. parseInt는 두 개의 인자를 받으며,
// 첫 번째 인자에는 숫자로 변환하고 싶은 값을 넣고, 두 번재 인자는 특정 진수를 나타내는 정수값을 넣습니다. => 문자열을 정수형으로 변환

// parseInt(값, 진수);


// console.log(parseInt('15')); // 두 번째 인자가 없는 경우, 기본값인 10진수로 숫자를 변환합니다.
// console.log(parseInt('15', 10)); // 숫자 10을 넣어 사용할 수도 있습니다.
// console.log(parseInt('15', 2)); // 2진수 숫자로 변환함으로 숫자 1을 반환합니다.
// console.log(parseInt(5.15)); // 실수인 숫자 또는 문자를 정수로 변환하는데 parseInt 함수를 사용할 수 있습니다.
// console.log(parseInt('5.15'));

